Тестовая_база_ERP_14/src/AccumulationRegisters/ДвиженияДенежныхСредств/ДвиженияДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияДенежныхСредств</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКВыплатеВРамкахЛимита</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаКВыплатеСверхЛимита</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВКорВалюте</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИсточникГФУДенежныхСредств</name>
    <type>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникКорГФУДенежныхСредств</name>
    <type>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДенежныеСредства</name>
    <type>
      <types>CatalogRef.ДенежныеДокументы</types>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПлатежаФЗ275</name>
    <type>
      <types>CatalogRef.ТипыПлатежейФЗ275</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорДенежныеСредства</name>
    <type>
      <types>CatalogRef.ДенежныеДокументы</types>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ЭквайринговыеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипыДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тестовая_база_ERP_14/src/Enums/ТипыИсточниковУточненияСчета/ТипыИсточниковУточненияСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИсточниковУточненияСчета</name>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредствДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДенежныхСредствКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходовДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаДоходовРасходовКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатурыДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаНоменклатурыКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетовДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаРасчетовКредита</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаВнеоборотныхАктивов</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаВнеоборотныхАктивовДебета</name>
  </enumValues>
  <enumValues>
    <name>ГруппаФинансовогоУчетаВнеоборотныхАктивовКредита</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ИсточникиПодразделенийАналитическихРегистров/ИсточникиПодразделенийАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиПодразделенийАналитическихРегистров</name>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредствОтправителя</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДенежныхСредствПолучателя</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаДоходовРасходов</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>АналитикаУчетаПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ДоговорКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДокументОплаты</name>
  </enumValues>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>ОбъектРасчетовСКонтрагентом</name>
  </enumValues>
  <enumValues>
    <name>КорОбъектРасчетовСКонтрагентом</name>
  </enumValues>
  <enumValues>
    <name>ХозяйственнаяОперация</name>
  </enumValues>
  <enumValues>
    <name>Подразделение</name>
  </enumValues>
  <enumValues>
    <name>КорПодразделение</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ИсточникиНаправленийДеятельностиАналитическихРегистров/ИсточникиНаправленийДеятельностиАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникиНаправленийДеятельностиАналитическихРегистров</name>
  <enumValues>
    <name>НаправлениеДеятельностиКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельностиНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельностиДС</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельностиСтатьи</name>
  </enumValues>
  <enumValues>
    <name>НаправлениеДеятельности</name>
  </enumValues>
  <enumValues>
    <name>КорНаправлениеДеятельности</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/ПоказателиАналитическихРегистров/ПоказателиАналитическихРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиАналитическихРегистров</name>
  <enumValues>
    <name>Себестоимость</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СебестоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Стоимость</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СтоимостьРегл</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>СуммаБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовДебета</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеВзаиморасчетовКредита</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеДокумента</name>
  </enumValues>
  <enumValues>
    <name>СуммаВВалютеПлатежа</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаДопРасходовБезНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДС</name>
  </enumValues>
  <enumValues>
    <name>СуммаНДСДопРасходов</name>
  </enumValues>
  <enumValues>
    <name>СуммаОплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПостоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаПредоплаты</name>
  </enumValues>
  <enumValues>
    <name>СуммаРегл</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеВРамкахЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплатеСверхЛимита</name>
  </enumValues>
  <enumValues>
    <name>СуммаКВыплате</name>
  </enumValues>
  <enumValues>
    <name>СуммаВКорВалюте</name>
  </enumValues>
  <enumValues>
    <name>СуммаУпрСНДС</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/Кассы/Кассы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кассы</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>КассоваяКнига</name>
    <type>
      <types>CatalogRef.КассовыеКниги</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДенежныхСредств</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПлатежиБезУказанияЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИнкассации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКассаОбособленногоПодразделения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПлатежейПриПеремещенииДС</name>
    <attributes>
      <name>ПолучательПлатежа</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/AccumulationRegisters/ДвиженияДенежныхСредств/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ НЕ УТ
#Область ПрограммныйИнтерфейс
//++ НЕ УТКА

// Определяет источники уточнения счета, доступные в регистре и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиУточненияСчета().
//
// Параметры:
//  СвойстваИсточника - Строка - "ИмяПоля" - имя атрибута регистра накопления, из которого планируется получать источник
//                               уточнения счета.
//
// Возвращаемое значение:
//  Соответствие - Ключ - название источника уточнения счета. 
//                 Значение - структура свойств источника уточнения счета.
//
Функция ИсточникиУточненияСчета(СвойстваИсточника) Экспорт
	
	ИсточникиУточненияСчета = Новый Соответствие;
	
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаДенежныхСредствКредита,
		Новый Структура(СвойстваИсточника, "ГФУДенежныхСредств"));
		
	ИсточникиУточненияСчета.Вставить(Перечисления.ТипыИсточниковУточненияСчета.ГруппаФинансовогоУчетаДенежныхСредствДебета,
		Новый Структура(СвойстваИсточника, "КорГФУДенежныхСредств"));
		
	Возврат ИсточникиУточненияСчета;
	
КонецФункции

// Определяет источники подразделений регистра и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиПодразделений().
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя источника. 
//                 Значение - структура свойств источника. 
//
Функция ИсточникиПодразделений() Экспорт

	ИсточникиПодразделений = Новый Соответствие;
	
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.ХозяйственнаяОперация, "Подразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.АналитикаУчетаДенежныхСредствОтправителя, "ДенежныеСредстваПодразделение");
	ИсточникиПодразделений.Вставить(Перечисления.ИсточникиПодразделенийАналитическихРегистров.АналитикаУчетаДенежныхСредствПолучателя, "КорДенежныеСредстваПодразделение");
	
    Возврат ИсточникиПодразделений;
	
КонецФункции

// Определяет источники направлений регистра и их свойства.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиНаправлений().
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя источника. 
//                 Значение - структура свойств источника. 
//
Функция ИсточникиНаправлений() Экспорт

	Результат = Новый Соответствие;
	
	ИсточникиНаправлений = Перечисления.ИсточникиНаправленийДеятельностиАналитическихРегистров;
	Результат.Вставить(ИсточникиНаправлений.НаправлениеДеятельности, "НаправлениеДеятельности");
	Результат.Вставить(ИсточникиНаправлений.КорНаправлениеДеятельности, "КорНаправлениеДеятельности");

	Возврат Результат;

КонецФункции

// Определяет источники заполнения субконто.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ИсточникиСубконто().
//
// Возвращаемое значение:
//  Массив - массив атрибутов регистра.
//
Функция ИсточникиСубконто() Экспорт

	МассивСубконтоДт = Новый Массив;
	МассивСубконтоДт.Добавить("КорДенежныеСредства");
	МассивСубконтоДт.Добавить("КорТипДенежныхСредств");
	МассивСубконтоДт.Добавить("СтатьяДвиженияДенежныхСредств");
	
	МассивСубконтоКт = Новый Массив;
	МассивСубконтоКт.Добавить("ДенежныеСредства");
	МассивСубконтоКт.Добавить("ТипДенежныхСредств");
	МассивСубконтоКт.Добавить("СтатьяДвиженияДенежныхСредств");

	Возврат Новый Структура("СубконтоДт, СубконтоКт", МассивСубконтоДт, МассивСубконтоКт);
	
КонецФункции

// Определяет показатели в валюте регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ПоказателиВВалюте().
//
// Параметры:
//  СвойстваПоказателей - Строка - "ИсточникВалюты" - источник валюты для показателя регистра.
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция ПоказателиВВалюте(СвойстваПоказателей) Экспорт

	ПоказателиВВалюте = Новый Соответствие;
	
	ПоказателиВВалюте.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаВВалюте, Новый Структура(СвойстваПоказателей, "Валюта"));
	ПоказателиВВалюте.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаВКорВалюте, Новый Структура(СвойстваПоказателей, "КорВалюта"));
	
	Возврат ПоказателиВВалюте;

КонецФункции

// Определяет документы отражаемые в международном учете.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.ДокументыКОтражениюВМФУ().
//
// Возвращаемое значение:
//  Массив - массив регистраторов регистра отражаемых в международном учете.
//
Функция ДокументыКОтражениюВМеждународномУчете() Экспорт

	ДокументыКОтражению = Новый Массив;
	ДокументыКОтражению.Добавить("ВнесениеДенежныхСредствВКассуККМ");
	ДокументыКОтражению.Добавить("ВыбытиеДенежныхДокументов");
	ДокументыКОтражению.Добавить("ВыемкаДенежныхСредствИзКассыККМ");
	ДокументыКОтражению.Добавить("ПоступлениеДенежныхДокументов");
	ДокументыКОтражению.Добавить("ПриходныйКассовыйОрдер");
	ДокументыКОтражению.Добавить("РасходныйКассовыйОрдер");
	ДокументыКОтражению.Добавить("ПоступлениеБезналичныхДенежныхСредств");
	ДокументыКОтражению.Добавить("СписаниеБезналичныхДенежныхСредств");
	
	Возврат ДокументыКОтражению;

КонецФункции
//-- НЕ УТКА

// Определяет показатели регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.Показатели().
//
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов.
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	// Массив содержит не только ресурсы регистров, но и производные от них поля в запросах.
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "Сумма", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаРегл", "ВалютаРегл"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВВалюте", "Валюта"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаВКорВалюте", "КорВалюта"));
	
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаКВыплатеВРамкахЛимита", "Валюта"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаКВыплатеВРамкахЛимита, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаКВыплатеСверхЛимита", "Валюта"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаКВыплатеСверхЛимита, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СуммаКВыплате", "Валюта"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаКВыплате, Новый Структура(СвойстваПоказателей, МассивРесурсов));

	Возврат Показатели;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)
	|	И( ВЫБОР КОГДА ТипЗначения(ДенежныеСредства) = Тип(Справочник.Кассы) ТОГДА ЗначениеРазрешено(ДенежныеСредства)
	|	КОГДА ТипЗначения(ДенежныеСредства) = Тип(Справочник.КассыККМ) ТОГДА ЗначениеРазрешено(ДенежныеСредства)
	|	КОГДА ТипЗначения(ДенежныеСредства) = Тип(Справочник.ФизическиеЛица) ТОГДА ЗначениеРазрешено(ДенежныеСредства)
	|	ИНАЧЕ ИСТИНА КОНЕЦ) ";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецЕсли
